/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine 無法完成備份。";

/* error dialog buttons */
OK = "好";
PREFERENCES = "打開 Time Machine 偏好設定⋯";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "此電腦上的 Time Machine 設定由“管理偏好設定”控制 - 請聯絡系統管理者。";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "無錯誤。";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "無法啟動 Time Machine。";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "無法完成備份。在製作備份檔案夾時發生錯誤。"; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "備份磁碟的格式不是 Mac OS 擴充格式（日誌式），必須使用這種格式。\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "打開 Time Machine 偏好設定來選擇其他的備份磁碟。";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "無法取得備份磁碟的狀態。"; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "備份磁碟未啟用持有人權限。您必須啟用持有人權限才能使用此磁碟進行 Time Machine 備份。\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "打開 Time Machine 偏好設定來選擇其他的備份磁碟。";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "備份磁碟的格式不是 Mac OS 擴充格式（日誌式），必須使用這種格式。\n\n%@";
RESULTCODE_6_SHOWPREFS = "打開 Time Machine 偏好設定來選擇其他的備份磁碟。"; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "此備份太大，備份磁碟無法容納。備份需要 %@ 的空間，但只有 %@ 可用。\n\n%@";
RESULTCODE_7_SHOWPREFS = "除了用來儲存備份的空間之外，Time Machine 還需要備份磁碟上的工作空間。請打開 Time Machine 偏好設定來選擇一個更大的備份磁碟，或刪除一些檔案讓備份變小。"; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "檔案是“唯讀的”，因此無法拷貝到備份磁碟上。\n\n%@";
RESULTCODE_8_SHOWPREFS = "您可能需要使用“磁碟工具程式”來修復或重新格式化磁碟。若磁碟無法修復，您必須使用不同的磁碟來進行備份。請打開 Time Machine 偏好設定來選擇不同的備份磁碟。"; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "備份磁碟未啟用“連線權限控制列表”，您必須啟用這個項目。\n\n%@";
RESULTCODE_9_SHOWPREFS = "打開 Time Machine 偏好設定來選擇其他的備份磁碟。"; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "準備備份時發生錯誤。"; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "將檔案拷貝到備份磁碟上時發生錯誤，因此未執行備份。";
RESULTCODE_11_MESSAGE = "問題可能只是暫時性的。請稍後再嘗試備份。若問題持續發生，請使用“磁碟工具程式”來修復您的備份磁碟。";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "連結備份磁碟上的檔案時發生錯誤。"; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "備份期間變更的檔案太多。"; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "從備份磁碟移除過期備份時發生錯誤。";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "已移除所有過期備份，但備份磁碟仍是滿的。\n\n%@";
RESULTCODE_15_SHOWPREFS = "打開 Time Machine 偏好設定來選擇一個更大的備份磁碟。";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "已移除所有過期備份，但備份磁碟仍是滿的。\n\n%@";
RESULTCODE_16_SHOWPREFS = "打開 Time Machine 偏好設定來選擇一個更大的備份磁碟。"; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "未選擇任何備份磁碟。\n\n%@";
RESULTCODE_17_SHOWPREFS = "打開 Time Machine 偏好設定來選擇一個備份磁碟。";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "找不到備份磁碟。\n\n%@";
RESULTCODE_18_SHOWPREFS = "請確定已連接備份磁碟，或打開 Time Machine 偏好設定來選擇其他的備份磁碟。"; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "無法使用備份磁碟。"; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "無法製作備份磁碟映像檔“%@”（錯誤 %@）。"; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "無法取用備份磁碟映像檔“%@”（錯誤 %@）。"; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "已取消備份。"; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "您正在備份的磁碟有區分大小寫，但備份磁碟沒有區分大小寫。\n\n%@";
RESULTCODE_23_SHOWPREFS = "打開 Time Machine 偏好設定來選擇其他備份磁碟，或選擇不備份有區分大小寫的磁碟。"; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "兩個準備進行備份的磁碟使用相同的名稱。請重新命名其中一個磁碟。"; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "沒有要進行備份的磁碟。若所有磁碟都在“不要備份”列表中，便可能發生此種狀況。\n\n%@";
RESULTCODE_25_SHOWPREFS = "若要編輯選單，請打開 Time Machine 偏好設定，並且按一下“選項⋯”。";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "由於網路發生問題，Time Machine 無法完成備份。";
RESULTCODE_26_MESSAGE = "請確定您的電腦與備份磁碟是位於相同的網路上，且備份磁碟已啟用。然後再嘗試備份一次。";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "備份磁碟可能已從您的電腦退出或中斷連線。";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "備份磁碟未預期地用完空間。Time Machine 將在排定的下一次備份期間移除過期的備份，藉此騰出一些空間。\n\n%@";
RESULTCODE_28_SHOWPREFS = "打開 Time Machine 偏好設定來選擇一個更大的備份磁碟，或刪除一些檔案讓備份變小。"; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "無法取用網路備份磁碟，因為網路使用者名稱或密碼有問題。\n\n%@";
RESULTCODE_29_SHOWPREFS = "打開 Time Machine 偏好設定來選擇網路備份磁碟，並重新輸入正確的使用者名稱和密碼。";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "嘗試重複使用備份“%@”時發生錯誤。";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "備份磁碟映像檔“%@”已在使用中。";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "找不到備份磁碟映像檔“%@”。";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "系統日期與時間不正確。";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "電腦沒有主要網路介面。";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine 找不到它的部分設定。\n\n%@";
RESULTCODE_35_SHOWPREFS = "若要重新建立 Time Machine 的設定，請打開“Time Machine 偏好設定”並重新選擇備份磁碟。";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine 在備份磁碟“%@”上找不到它的部分設定。\n\n請確定您已連接備份磁碟，而且其他已連接的磁碟沒有使用與備份磁碟相同的名稱。\n\n%@";
RESULTCODE_36_SHOWPREFS = "若要重新建立 Time Machine 的設定，請打開“Time Machine 偏好設定”並重新選擇備份磁碟。";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "正在備份的其中一個磁碟可能已從您的電腦退出或中斷連線。";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine 無法使用磁碟映像檔，因為無法寫入。";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine 無法驗證備份，因為無法使用備份磁碟。";
RESULTCODE_40_MESSAGE = "請確定您的電腦與備份磁碟是位於相同的網路上，且備份磁碟已啟用。然後再嘗試驗證備份一次。";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine 無法驗證備份。";
RESULTCODE_41_MESSAGE = "備份磁碟是“唯讀的”。";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine 無法驗證備份，因為驗證中斷。";
RESULTCODE_42_MESSAGE = "中斷通常是由網路問題所造成的。解決網路問題後請再試一次。";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine 無法移動現有的備份磁碟映像檔“%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine 無法刪除備份磁碟映像檔“%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "錯誤碼：%@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "備份磁碟將滿。";
RESULTCODE_1000_MESSAGE = "如果備份磁碟已滿，Time Machine 將刪除舊的備份來騰出空間供新的備份使用。\n\n%@";
RESULTCODE_1000_SHOWPREFS = "如果您想要保留所有舊的備份，請打開 Time Machine 偏好設定來選擇新的備份磁碟。";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "備份磁碟已滿。";
RESULTCODE_1001_MESSAGE = "Time Machine 刪除了一或多個舊有備份來騰出空間供新備份使用。剩餘的最舊的備份是：%@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "若要避免刪除其他的舊有備份，請打開 Time Machine 偏好設定來選擇其他的備份磁碟。"; 
RESULTCODE_1001_CHECKBOX = "不要再顯示這個警告。";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine 在 %@ 天內並沒有備份您的電腦。\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "請確定您的備份磁碟可以使用，或打開 Time Machine 偏好設定來選擇新的備份磁碟。";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "您想要在此電腦上重複使用備份“%@”嗎？";
RESULTCODE_1003_MESSAGE = "備份是在其他電腦上製作的。如果您重複使用此備份，原始電腦將無法再使用它。";
REUSE_BACKUP_BUTTON = "重複使用備份";
CREATE_NEW_BACKUP_BUTTON = "製作新備份";
ASK_LATER_BUTTON = "不要現在備份";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "有更新項目可供“%@”使用。";
RESULTCODE_1004_MESSAGE = "此更新項目改進了 Time Capsule 的可靠性。若要安裝此更新項目，請打開“AirPort 工具程式”。您可能需要提供“%@”的 Time Capsule 密碼。";
REMIND_LATER_BUTTON = "稍後更新";
AIRPORT_UTILITY_BUTTON = "打開 AirPort 工具程式⋯";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine 已完成驗證您的備份。Time Machine 必須製作新的備份才能改進穩定性。";
RESULTCODE_1006_MESSAGE = "按一下“開始新備份”來製作新的備份。這將移除現有的備份記錄。備份可能需要幾個小時的時間。\n\n按一下“稍後備份”來讓系統於明天提示您備份。Time Machine 不會在此時執行備份。";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "開始新備份";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "稍後備份";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "上一次備份之後備份磁碟的識別身分已經變更。";
RESULTCODE_1008_MESSAGE = "磁碟可能已經更換或清除，或者可能有不明人士嘗試誤導您的電腦來備份至錯誤的磁碟。";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "使用這個磁碟";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "不要備份";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
